#!/usr/bin/python3

# Assignment 03-01
#
# Задача: знайти та виведіть на екран - чи належіть точка кільцю 
#      (площа між двома колами з однаковим центром та різним радіусом)
#
# Варіанти виводу на екран:
#
#      1. "Точка (Px, Py) належить кільцю за центром у точці (Cx, Cy), та r1 = R1, r2 = R2"
#      2. "Точка (Px, Py) не належить кільцю за центром у точці (Cx, Cy), та r1 = R1, r2 = R2"
#
# Формула відстані від заданої до центру кола: 
#           
#      L = sqrt((Px-Cx)^2 + (Py-Cy)^2), 
#
#      якщо умова - r1 < L < r2 - виконується - точка належить кільцю, 
#      інакше - ні
#
#      де: 
#          L - відстань між двома точками з коордінатами
#          Px, Py - координата точки
#          Cx, Cy - координата центру кола r1 та r2
#          r1, r2 - радіус внутрішньго/зовнішнього кола 
#
# Приклад приналежності:
#
# Cx = 0, Cy = 0
# r1 = 3
# r2 = 7
# Px = 4, Py = 5
#
# L = sqrt((4-0)^2 + (5-0)^2) == 6.4
# 3 < 6.4 < 7 то ж точка з такою координатою лежить у площі кільця
#
import math
Px = int(input("Please, enter Px:"))  # приклад зчитування значення від користувача
Py = int(input("Please, enter Py:"))
Cx = int(input("Please, enter Cx"))
Cy = int(input("Please, enter Cy:"))
r1 = int(input("Please, enter r1:"))
r2 = int(input("Please, enter r2:"))
L = ((Px-Cx)**2 + (Py-Cy)**2)**.5
if r1 < L < r2:
    print(f"Точка ({Px}, {Py}) належить кільцю за центром у точці ({Cx}, {Cy}), та r1 ={r1}, r2 = {r2}")
else:
    print(f"Точка ({Px}, {Py}) не належить кільцю за центром у точці ({Cx}, {Cy}), та r1 = {r1}, r2 = {r2}")
# частина інструкції if для виводу остаточного результату
#else:
#    print(f"Точка ({Px}, {Py}) не належить кільцю за центром у точці ({Cx}, {Cy}), та r1 = {r1}, r2 = {r2}")

